local charmaps = {}

charmaps.asciify_tbl = {
  ["ç"] = "c",
  ["Ç"] = "C",
  ["ğ"] = "g",
  ["Ğ"] = "G",
  ["ö"] = "o",
  ["Ö"] = "O",
  ["ü"] = "u",
  ["Ü"] = "U",
  ["ı"] = "i",
  ["İ"] = "I",
  ["ş"] = "s",
  ["Ş"] = "S",
}

charmaps.downcase_marker_tbl = {
  ["Ç"] = "c",
  ["ç"] = "c",
  ["Ğ"] = "g",
  ["ğ"] = "g",
  ["Ö"] = "o",
  ["ö"] = "o",
  ["İ"] = "i",
  ["ı"] = "i",
  ["Ş"] = "s",
  ["ş"] = "s",
  ["Ü"] = "u",
}

charmaps.upcase_marker_tbl = {
  ["ç"] = "C",
  ["Ç"] = "C",
  ["ğ"] = "G",
  ["Ğ"] = "G",
  ["ö"] = "O",
  ["Ö"] = "O",
  ["ı"] = "I",
  ["İ"] = "i",
  ["ş"] = "S",
  ["Ş"] = "S",
  ["ü"] = "U",
  ["Ü"] = "U",
}

charmaps.toggle_tbl = {
  ["c"] = "ç",
  ["C"] = "Ç",
  ["g"] = "ğ",
  ["G"] = "Ğ",
  ["o"] = "ö",
  ["O"] = "Ö",
  ["u"] = "ü",
  ["U"] = "Ü",
  ["i"] = "ı",
  ["I"] = "İ",
  ["s"] = "ş",
  ["S"] = "Ş",
  ["ç"] = "c",
  ["Ç"] = "C",
  ["ğ"] = "g",
  ["Ğ"] = "G",
  ["ö"] = "o",
  ["Ö"] = "O",
  ["ü"] = "u",
  ["Ü"] = "U",
  ["ı"] = "i",
  ["İ"] = "I",
  ["ş"] = "s",
  ["Ş"] = "S",
}

return charmaps
